public_html/docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-20 vie 12:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>docker</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">docker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org047d133">1. Instalación</a>
<ul>
<li><a href="#org9e1044d">1.1. Ejecutar sin sudo</a></li>
</ul>
</li>
<li><a href="#org515cabf">2. Comandos básicos</a>
<ul>
<li><a href="#org8e748bd">2.1. Sistema</a></li>
<li><a href="#org972cde4">2.2. Imágenes</a></li>
<li><a href="#orgcfff75d">2.3. Contenedores</a></li>
<li><a href="#org13ef34e">2.4. Redes</a></li>
<li><a href="#orgfdac7ab">2.5. Otros</a></li>
</ul>
</li>
<li><a href="#org4ee6d1e">3. Moviendo un contenedor a otro Host</a></li>
<li><a href="#org03e33b4">4. Crear un contenedor</a></li>
<li><a href="#orgf59bcec">5. Mis contenedores</a></li>
</ul>
</div>
</div>
<p>
<a href="https://www.docker.com">Docker</a> es un proyecto de código abierto que automatiza el despliegue de aplicaciones dentro de contenedores de software, proporcionando así una capa adicional de abstracción y automatización de virtualización de aplicaciones en múltiples sistemas operativos.
</p>

<div id="outline-container-org047d133" class="outline-2">
<h2 id="org047d133"><span class="section-number-2">1.</span> Instalación</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-bash">curl -fsSL https://get.docker.com -o get-docker.sh
chmod u+x get-docker.sh
sudo ./get-docker.sh
sudo usermod -aG docker $(whoami)
</pre>
</div>

<p>
<b><b>Tras la instalación hay que cerrar la sesión de la terminal y volverla a abrir para que los cambios surtan efecto.</b></b>
</p>
</div>

<div id="outline-container-org9e1044d" class="outline-3">
<h3 id="org9e1044d"><span class="section-number-3">1.1.</span> Ejecutar sin sudo</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-bash">sudo groupadd docker
sudo usermod -aG docker &lt;usuario&gt;
su - &lt;usuario&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org515cabf" class="outline-2">
<h2 id="org515cabf"><span class="section-number-2">2.</span> Comandos básicos</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Formatear la salida (json) -&gt; <code>comando --format '{{ json . }}' | jq</code></li>
<li>Parar un contenedor - docker stop xxxxxxxxx</li>
<li>Parar todos contenedores - docker stop `docker ps -q`</li>
<li>Listar todos contenedores - <code>docker container ls</code></li>
<li>Lanzar un docker-compose.yml -&gt; <code>docker compose up</code></li>
<li>Lanzar un docker-compose.yml (Segundo plano) -&gt; <code>docker compose up -d</code></li>
</ul>
</div>

<div id="outline-container-org8e748bd" class="outline-3">
<h3 id="org8e748bd"><span class="section-number-3">2.1.</span> Sistema</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Obtener info del sistema -&gt; <code>docker system info --format 'El número de CPU es: {{ .NCPU }}'</code></li>
<li>Obtener info del sistema (json) -&gt; <code>docker system info --format '{{ json .}}' | jq</code></li>
<li>Estadísticas (Instantáneas) -&gt; <code>docker container stats --no-stream</code></li>
<li>Estadísticas (Tiempo real) -&gt; <code>docker container stats</code></li>
<li>Espacio usado -&gt; <code>docker system df</code></li>
</ul>
</div>
</div>

<div id="outline-container-org972cde4" class="outline-3">
<h3 id="org972cde4"><span class="section-number-3">2.2.</span> Imágenes</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Descargar -&gt; ~docker image pull &lt;imagen&gt;</li>
<li>Listar (Todas) -&gt; <code>docker image ls</code></li>
<li>Listar (filtro) -&gt; <code>docker image list filtro</code></li>
<li>Borrar (Todas) -&gt; <code>docker rmi -f $(docker images -q)</code></li>
<li>Buscar -&gt; <code>docker search nginx</code></li>
<li>Inspeccionar -&gt; <code>docker image inspect hello-world --format '{{ json .Config }}' | jq</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgcfff75d" class="outline-3">
<h3 id="orgcfff75d"><span class="section-number-3">2.3.</span> Contenedores</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Listar (Todos que están corriendo) -&gt; <code>docker container ls</code></li>
<li>Listar (Todos) -&gt; <code>docker container ls --all</code></li>
<li>Listar Contenedores y puertos -&gt; <code>docker container ls --format 'table {{.ID}}\t{{.Image}}\t{{.Ports}}'</code></li>
<li>Variables de entorno (Listar) -&gt; <code>docker exec -it id env</code></li>
<li>Borrar -&gt; <code>docker container rm id</code></li>
<li>Borrar (Todos) -&gt; <code>docker rm -f $(docker ps -aq)</code></li>
<li>Borrar (Todos forzando) -&gt; <code>docker container rm -f $(docker container ls -aq)</code></li>
<li>Arranque en modo interactivo -&gt; <code>docker container run -it &lt;imagen&gt;</code></li>
<li>Arranque desacoplado -&gt; <code>docker container run --detach &lt;imagen&gt;</code> (o tambien <code>-d</code>)</li>
<li>Arranque montando volumen -&gt; <code>docker run -it --rm -v ~/local:/contenedor &lt;imagen&gt;</code></li>
<li>Parar un contenedor -&gt; <code>docker container stop &lt;contenedor&gt;</code></li>
<li>Parar todos contenedores -&gt; <code>docker container stop $(docker container ls -aq)</code></li>
<li>Puertos -&gt; <code>docker container run --publish &lt;máquina&gt;:&lt;contenedor&gt; &lt;imagen&gt;</code></li>
<li>Consultar log y esperar -&gt; <code>docker container logs --follow &lt;contenedor&gt;</code></li>
<li>Consultar log -&gt; <code>docker container logs &lt;contenedor&gt;</code></li>
<li>Consultar log (parámetros) -&gt; <code>-since</code> (Desde), <code>-tail</code> (Ultimos), <code>-until</code> (Hasta)</li>
<li>IP asignada -&gt; <code>docker container inspect &lt;id&gt; --format '{{ json .NetworkSettings.Networks.bridge.IPAddress }}'</code></li>
</ul>
</div>
</div>

<div id="outline-container-org13ef34e" class="outline-3">
<h3 id="org13ef34e"><span class="section-number-3">2.4.</span> Redes</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Listar -&gt; <code>docker network ls</code></li>
<li>Inspeccionar -&gt; <code>docker network inspect &lt;nombre&gt;</code></li>
<li>Contenedores conectados a red -&gt; <code>docker network inspect bridge --format='{{ json .Containers }}'</code></li>
<li>Crear nueva red "bridge" -&gt; <code>docker network create --driver bridge &lt;nombre&gt;</code></li>
<li>Eliminar una red -&gt; <code>docker network rm &lt;nombre&gt;</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgfdac7ab" class="outline-3">
<h3 id="orgfdac7ab"><span class="section-number-3">2.5.</span> Otros</h3>
</div>
</div>
<div id="outline-container-org4ee6d1e" class="outline-2">
<h2 id="org4ee6d1e"><span class="section-number-2">3.</span> Moviendo un contenedor a otro Host</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Asegurarse que Docker está instalado en el otro Host</li>
<li>scp -r ~/dockers/intrubot pi@192.168.10.210:~/dockers/</li>
<li>sudo apt-get install docker-compose</li>
</ul>
</div>
</div>
<div id="outline-container-org03e33b4" class="outline-2">
<h2 id="org03e33b4"><span class="section-number-2">4.</span> Crear un contenedor</h2>
<div class="outline-text-2" id="text-4">
<p>
docker run -it &#x2013;name test-deps ubuntu:22.04 /bin/bash
</p>

<p>
Partiendo de ubuntu:22.04
apt update
apt upgrade -y
apt install -y curl
apt install -y unzip
curl <a href="https://rclone.org/install.sh">https://rclone.org/install.sh</a> | bash
</p>
</div>
</div>


<div id="outline-container-orgf59bcec" class="outline-2">
<h2 id="orgf59bcec"><span class="section-number-2">5.</span> Mis contenedores</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="dcb_docker.html#ID-b2b7453a-a285-4efd-bd8a-54f6a421513c">dcb</a></li>
<li><a href="homepage_docker.html#ID-f101a6aa-063a-4e6c-9f11-ef68717cb524">homepage</a> (4000)</li>
<li>hugo-dev</li>
<li>intrubot</li>
<li><a href="karakeep_docker.html#ID-58cdee51-009c-4daa-8b82-1a052c31b948">karakeep</a> (3000)</li>
<li>minetest</li>
<li>n8n</li>
<li>nginx</li>
<li>nginx-proxy-manager</li>
<li>readeck</li>
<li>rsstt</li>
<li>sherlocast</li>
<li>zerotier-monitor</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-05 lun 00:00</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 12:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
